# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [3]:
import numpy as np

n_rows = 100

number_1 = pd.Series(np.random.randint(low=1, high=5, size=n_rows))
number_2 = pd.Series(np.random.randint(low=1, high=4, size=n_rows))
number_3 = pd.Series(np.random.randint(low=10_000, high=30_001, size=n_rows))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [4]:
df = pd.concat([number_1, number_2, number_3], axis=1)
df.head()

   0  1      2
0  2  2  15267
1  1  2  27925
2  4  2  15880
3  3  3  24826
4  4  3  17017

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [9]:
df = df.rename(columns={0: "bedrs", 1: "bathrs", 2: "price_sqr_meter"})
df.head()

   bedrs  bathrs  price_sqr_meter
0      2       2            15267
1      1       2            27925
2      4       2            15880
3      3       3            24826
4      4       3            17017

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [15]:
bigcolumn = pd.DataFrame(pd.concat([number_1, number_2, number_3], axis=0))

bigcolumn

        0
0       2
1       1
2       4
3       3
4       4
..    ...
95  13158
96  12705
97  10142
98  12568
99  12777

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [12]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [14]:
bigcolumn.index = np.arange(0, 300)
bigcolumn

         0
0        2
1        1
2        4
3        3
4        4
..     ...
295  13158
296  12705
297  10142
298  12568
299  12777

[300 rows x 1 columns]

In [19]:
bigcolumn.reset_index(drop=True)

         0
0        2
1        1
2        4
3        3
4        4
..     ...
295  13158
296  12705
297  10142
298  12568
299  12777

[300 rows x 1 columns]